## Curso criando conexao com o mysql e o python

In [1]:
#pagina 124


terminal: conda env list
terminal: conda activate Maq_AmbienteVirtual
terminal: sudo mysql -u root -p
[sudo] senha para computador:    
Enter password: admin
Welcome to the MySQL monitor.  Commands end with ; or \g.
Your MySQL connection id is 8
Server version: 8.0.36-0ubuntu0.20.04.1 (Ubuntu)

Copyright (c) 2000, 2024, Oracle and/or its affiliates.

Oracle is a registered trademark of Oracle Corporation and/or its
affiliates. Other names may be trademarks of their respective
owners.

Type 'help;' or '\h' for help. Type '\c' to clear the current input statement.

mysql> show databases;
+---------------------+
| Database            |
+---------------------+
| banco_dados_teste   |
| bdyoutube           |
| clientes_aula       |
| information_schema  |
| meu_banco_de_dados2 |
| meu_novo            |
| mysql               |
| novodados           |
| pedido_aula         |
| performance_schema  |
| produtos_aula       |
| questao             |
| sys                 |
+---------------------+
13 rows in set (2,86 sec)

mysql> USE banco_dados_teste;
Reading table information for completion of table and column names
You can turn off this feature to get a quicker startup with -A

Database ch

# no mysql



Terminal: sudo mysql -u root -p

mysql> CREATE database banco_dados_teste;

mysql> USE banco_dados_teste;

mysql> CREATE TABLE banco_dados_teste.vendas(

    -> id INT PRIMARY KEY AUTO_INCREMENT,
    
    -> name VARCHAR(100),
    
    -> price DECIMAL(10,2),
    
    -> quantity INT   );
    
Query OK, 0 rows affected (0,48 sec)

In [3]:
import mysql.connector


conexao = mysql.connector.connect(
    host='localhost',
    user='root',
    password='admin',
    database='banco_dados_teste',
)

cursor = conexao.cursor()

In [4]:
#CREATE

# Execute the SQL query
cursor.execute("SELECT * FROM banco_dados_teste.vendas")

# Fetch all the rows from the query result
resultado = cursor.fetchall()

# Process the fetched rows
for row in resultado:
    print(row)

(1, 'todynho', Decimal('3.00'), 4)
(2, 'todynho', Decimal('3.00'), 4)
(3, 'agua', Decimal('1.00'), 4)
(4, 'todynho', Decimal('3.00'), 4)
(5, 'agua', Decimal('1.00'), 20)
(6, 'chocolate', Decimal('23.00'), 30)

In [5]:
# CRUD
nome_produto = "todynho"
valor= 3
quantidade=4
#colocar o valor na tabela
comando = f'INSERT INTO vendas (name, price,quantity) VALUES ("{nome_produto}",{valor},{quantidade})'
cursor.execute(comando)
conexao.commit() # edita o banco de dados

In [6]:
nome_produto = "agua"
valor= 1
quantidade=20
#colocar o valor na tabela
comando = f'INSERT INTO vendas (name, price,quantity) VALUES ("{nome_produto}",{valor},{quantidade})'
cursor.execute(comando)
conexao.commit() # edita o banco de dados

In [7]:
nome_produto = "chocolate"
valor= 23
quantidade=30
#colocar o valor na tabela
comando = f'INSERT INTO vendas (name, price,quantity) VALUES ("{nome_produto}",{valor},{quantidade})'
cursor.execute(comando)
conexao.commit() # edita o banco de dados

In [8]:
#ver
# Execute the SQL query
cursor.execute("SELECT * FROM banco_dados_teste.vendas")

# Fetch all the rows from 

resultado = cursor.fetchall()

print(resultado)
print()

for row in resultado:
    print(row)
#estamos com o autoincrement, por isso os dados sao inseridos

[(1, 'todynho', Decimal('3.00'), 4), (2, 'todynho', Decimal('3.00'), 4), (3, 'agua', Decimal('1.00'), 4), (4, 'todynho', Decimal('3.00'), 4), (5, 'agua', Decimal('1.00'), 20), (6, 'chocolate', Decimal('23.00'), 30), (7, 'todynho', Decimal('3.00'), 4), (8, 'agua', Decimal('1.00'), 20), (9, 'chocolate', Decimal('23.00'), 30)]

(1, 'todynho', Decimal('3.00'), 4)
(2, 'todynho', Decimal('3.00'), 4)
(3, 'agua', Decimal('1.00'), 4)
(4, 'todynho', Decimal('3.00'), 4)
(5, 'agua', Decimal('1.00'), 20)
(6, 'chocolate', Decimal('23.00'), 30)
(7, 'todynho', Decimal('3.00'), 4)
(8, 'agua', Decimal('1.00'), 20)
(9, 'chocolate', Decimal('23.00'), 30)

In [9]:
#outra maneira de observar o banco de dados
comando = f'SELECT * FROM banco_dados_teste.vendas'
cursor.execute(comando)
resultado = cursor.fetchall()#ler o banco de dados
print(resultado)

#cursor.close()
#conexao.close()

[(1, 'todynho', Decimal('3.00'), 4), (2, 'todynho', Decimal('3.00'), 4), (3, 'agua', Decimal('1.00'), 4), (4, 'todynho', Decimal('3.00'), 4), (5, 'agua', Decimal('1.00'), 20), (6, 'chocolate', Decimal('23.00'), 30), (7, 'todynho', Decimal('3.00'), 4), (8, 'agua', Decimal('1.00'), 20), (9, 'chocolate', Decimal('23.00'), 30)]

In [10]:
comando = f'SELECT * FROM vendas'
cursor.execute(comando)
resultado =cursor.fetchall()#ler o banco de dados

display(resultado)
cursor.close()
conexao.close()

[(1, 'todynho', Decimal('3.00'), 4),
 (2, 'todynho', Decimal('3.00'), 4),
 (3, 'agua', Decimal('1.00'), 4),
 (4, 'todynho', Decimal('3.00'), 4),
 (5, 'agua', Decimal('1.00'), 20),
 (6, 'chocolate', Decimal('23.00'), 30),
 (7, 'todynho', Decimal('3.00'), 4),
 (8, 'agua', Decimal('1.00'), 20),
 (9, 'chocolate', Decimal('23.00'), 30)]

### UPDATE

In [23]:
import mysql.connector

# Establish a connection to the database
conexao = mysql.connector.connect(
    host="localhost",
    user="root",
    password="admin",
    database="banco_dados_teste"
)

# Create a cursor object
cursor = conexao.cursor()

In [24]:


# Define the values for the update
nome_produto = "todynho"
valor = 7

# Execute the UPDATE statement
comando = f'UPDATE vendas SET price = {valor} WHERE name = "{nome_produto}" AND id=2'
cursor.execute(comando)

# Commit the changes
conexao.commit()

In [25]:
comando = f'SELECT * FROM vendas'
cursor.execute(comando)
resultado =cursor.fetchall()#ler o banco de dados

display(resultado)

[(1, 'todynho', Decimal('3.00'), 4),
 (2, 'todynho', Decimal('7.00'), 4),
 (3, 'agua', Decimal('1.00'), 4),
 (4, 'todynho', Decimal('3.00'), 4),
 (5, 'agua', Decimal('1.00'), 20),
 (6, 'chocolate', Decimal('23.00'), 30),
 (7, 'todynho', Decimal('3.00'), 4),
 (8, 'agua', Decimal('1.00'), 20),
 (9, 'chocolate', Decimal('23.00'), 30)]

In [26]:
# Close the cursor and the connection
cursor.close()
conexao.close()

# Consulta SQL para selecionar todos os dados da tabela

In [27]:
import pandas as pd

# Establish a connection to the database
conexao = mysql.connector.connect(
    host="localhost",
    user="root",
    password="admin",
    database="banco_dados_teste"
)

# Consulta SQL para selecionar todos os dados da tabela
query = "SELECT * FROM vendas"

# Leia os dados da tabela em um DataFrame do pandas
df = pd.read_sql(query, conexao)

# Exiba o DataFrame
print(df)

   id       name  price  quantity
0   1    todynho    3.0         4
1   2    todynho    7.0         4
2   3       agua    1.0         4
3   4    todynho    3.0         4
4   5       agua    1.0        20
5   6  chocolate   23.0        30
6   7    todynho    3.0         4
7   8       agua    1.0        20
8   9  chocolate   23.0        30

/tmp/ipykernel_14046/2150624491.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conexao)

In [28]:
# Feche a conexão
conexao.close()

In [30]:
print("Arquivo do sql mais elegante no dataframe")
display(df)

Arquivo do sql mais elegante no dataframe

   id       name  price  quantity
0   1    todynho    3.0         4
1   2    todynho    7.0         4
2   3       agua    1.0         4
3   4    todynho    3.0         4
4   5       agua    1.0        20
5   6  chocolate   23.0        30
6   7    todynho    3.0         4
7   8       agua    1.0        20
8   9  chocolate   23.0        30

# DELETAR

In [31]:
# Establish a connection to the database
conexao = mysql.connector.connect(
    host="localhost",
    user="root",
    password="admin",
    database="banco_dados_teste"
)


# Create a cursor object
cursor = conexao.cursor()

In [34]:

name_produte= "todynho"
comando = f'DELETE FROM vendas WHERE name="{name_produte}" AND id = 4 '
cursor.execute(comando)
conexao.commit()
#edita o banco de dados

In [35]:

name_produte= "chocolate"
comando = f'DELETE FROM vendas WHERE name="{name_produte}" AND id = 9 '
cursor.execute(comando)
conexao.commit()
#edita o banco de dados

In [36]:
# Consulta SQL para selecionar todos os dados da tabela
query = "SELECT * FROM vendas"

# Leia os dados da tabela em um DataFrame do pandas
df2 = pd.read_sql(query, conexao)

# Exiba o DataFrame
display(df2)

# Feche a conexão
#conexao.close()

/tmp/ipykernel_14046/2598331490.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2 = pd.read_sql(query, conexao)

   id       name  price  quantity
0   1    todynho    3.0         4
1   2    todynho    7.0         4
2   3       agua    1.0         4
3   5       agua    1.0        20
4   6  chocolate   23.0        30
5   7    todynho    3.0         4
6   8       agua    1.0        20

In [37]:
conexao.close()

# Revisão

In [38]:
import mysql.connector



# Conectar ao servidor MySQL
connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="admin"
)

# Criar um cursor
cursor = connection.cursor()

# Executar a consulta SQL para listar todos os bancos de dados
cursor.execute("SHOW DATABASES")

# Obter os nomes dos bancos de dados
bancos_de_dados = cursor.fetchall()

# Exibir os nomes dos bancos de dados
for banco_de_dados in bancos_de_dados:
    print(banco_de_dados[0])

# Fechar o cursor e a conexão
#cursor.close()
#connection.close()

banco_dados_teste
bdyoutube
clientes_aula
information_schema
meu_banco_de_dados2
meu_novo
mysql
novodados
pedido_aula
performance_schema
produtos_aula
questao
sys

In [39]:
cursor.close()
connection.close()

In [40]:
import mysql.connector

# Configurar a conexão com o banco de dados
conexao = mysql.connector.connect(
    host='localhost',
    user='root',
    password='admin',
    database='banco_dados_teste',
)

# Criar um cursor
cursor = conexao.cursor()

In [46]:

query1 = "CREATE TABLE banco_dados_teste.pedidos(id INT PRIMARY KEY AUTO_INCREMENT, name VARCHAR(100));"
cursor.execute(query1)

In [48]:
# CRUD
nome_produto_falta = "Pepsi"

#colocar o valor na tabela
comando = f'INSERT INTO pedidos (name) VALUES ("{nome_produto_falta}")'
cursor.execute(comando)
conexao.commit() # edita o banco de dados

# CRUD
nome_produto_falta = "Guaraná"

#colocar o valor na tabela
comando = f'INSERT INTO pedidos (name) VALUES ("{nome_produto_falta}")'
cursor.execute(comando)
conexao.commit() # edita o banco de dados

In [49]:
# Executar a consulta SQL para selecionar todos os dados da tabela
query = "SELECT * FROM pedidos"
cursor.execute(query)

# Obter todos os resultados da consulta
resultados0 = cursor.fetchall()

# Exibir os resultados
for linha in resultados0:
    print(linha)

(1, 'Pepsi')
(2, 'Guaraná')

In [50]:


# Fechar o cursor e a conexão
#cursor.close()
#conexao.close()


cursor.execute("SHOW TABLES")

# Obter os nomes das tabelas
tabelas = cursor.fetchall()

# Exibir os nomes das tabelas
for tabela in tabelas:
    print(tabela[0])

pedidos
vendas

In [51]:
cursor.close()
conexao.close()